## Staging: quicksight
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 2 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                  NAME                  |
|----------|----------------------------------------|
| recreate | `aws_quicksight_vpc_connection.rds`    |
| update   | `aws_quicksight_data_set.login_events` |
|          | `aws_quicksight_data_source.rds`       |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_quicksight_data_set.login_events will be updated in-place
  ~ resource "aws_quicksight_data_set" "login_events" {
        id             = "239043911459,login-events"
        name           = "Login Events"
        tags           = {}
        # (6 unchanged attributes hidden)

      - refresh_properties {
          - refresh_configuration {
              - incremental_refresh {
                  - lookback_window {
                      - column_name = "created_at" -> null
                      - size        = 1 -> null
                      - size_unit   = "DAY" -> null
                    }
                }
            }
        }

        # (5 unchanged blocks hidden)
    }

  # aws_quicksight_data_source.rds will be updated in-place
  ~ resource "aws_quicksight_data_source" "rds" {
        id             = "239043911459/NotificationCanadaCastaging"
        name           = "Quicksight RDS data source"
        tags           = {}
        # (5 unchanged attributes hidden)

      ~ vpc_connection_properties {
          ~ vpc_connection_arn = "arn:aws:quicksight:ca-central-1:239043911459:vpcConnection/vpc-097508d1f5e243195" -> (known after apply)
        }

        # (4 unchanged blocks hidden)
    }

  # aws_quicksight_vpc_connection.rds must be replaced
-/+ resource "aws_quicksight_vpc_connection" "rds" {
      ~ arn                 = "arn:aws:quicksight:ca-central-1:239043911459:vpcConnection/vpc-097508d1f5e243195" -> (known after apply)
      ~ availability_status = "AVAILABLE" -> (known after apply)
      ~ aws_account_id      = "239043911459" -> (known after apply)
      ~ id                  = "239043911459,vpc-097508d1f5e243195" -> (known after apply)
      ~ name                = "Quicksight RDS connection" -> "Quicksight RDS connection TEMP"
      ~ vpc_connection_id   = "vpc-097508d1f5e243195" -> "quicksight-rds-vpc-connection" # forces replacement
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-s3-usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_ec2"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_iam"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.vpc_connection_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.jobs"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.login_events"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.organisation"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.services"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.sms_usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.users"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.s3_sms_usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_vpc_connection.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.manifest_file"]

37 tests, 19 passed, 18 warnings, 0 failures, 0 exceptions

```

</details>
